# PANDAS ADVANCE PART 2 ASSIGNMENT

In [3]:
import pandas as pd

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

duration =  [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [4]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

### Q1. Write a code to print the data present in the second row of the dataframe, df.

In [11]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

### Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

pandas iloc takes integer location and  in loc we can provide the name as well.

In [12]:
df.iloc[0:2,0:1]

        course_name
0      Data Science
1  Machine Learning

In [14]:
df.loc[0:2,['course_name']]

        course_name
0      Data Science
1  Machine Learning
2          Big Data

### Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2].

###### Did you observe any difference in both the outputs? If so then explain it.

In [15]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [17]:
new_df = df.reindex([3,0,1,2])

In [18]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [19]:
df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [20]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

in new_df it is taking by default indexing not reset index

#### Available dataset

In [21]:
import pandas as pd

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]

#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [22]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.008987  0.324864  0.105220  0.215929  0.043844  0.205544
2  0.525643  0.939439  0.828907  0.933123  0.643853  0.008976
3  0.234392  0.469187  0.517200  0.943219  0.472862  0.469984
4  0.933037  0.324094  0.761387  0.166642  0.021803  0.576131
5  0.791503  0.540213  0.950585  0.379006  0.732422  0.484946
6  0.835030  0.494368  0.928875  0.681063  0.170177  0.596936

### Q4. Write a code to find the following statistical measurements for the above dataframe df1:

In [23]:
df1.mean()

column_1    0.554765
column_2    0.515361
column_3    0.682029
column_4    0.553164
column_5    0.347494
column_6    0.390420
dtype: float64

In [24]:
df1['column_2'].std()

0.22623214743502743

### Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2.

In [40]:
df1['column_2'][2]= '4'

In [41]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.008987  0.324864  0.105220  0.215929  0.043844  0.205544
2  0.525643         4  0.828907  0.933123  0.643853  0.008976
3  0.234392  0.469187  0.517200  0.943219  0.472862  0.469984
4  0.933037  0.324094  0.761387  0.166642  0.021803  0.576131
5  0.791503  0.540213  0.950585  0.379006  0.732422  0.484946
6  0.835030  0.494368  0.928875  0.681063  0.170177  0.596936

In [49]:
s=0
c=0
for i in df1['column_2']:
    
    if type(i)==str:
        s=s+int(i)
        c=c+1
                
    else:
        s=s+i
        c=c+1
                
print(s/c)

1.025454271704669

### Q6. What do you understand about the windows function in pandas and list the types of windows functions?

Window functions are an efficient way to understand more about the relationship between each of the records within our data and the groups they belong to.

### Q7. Write a code to print only the current month and year at the time of answering this question. [Hint: Use pandas.datetime function]

In [62]:
from datetime import datetime
year = datetime.now().year
month = datetime.now().month

In [63]:
year

2024

In [64]:
month

1

### Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

In [6]:
import pandas as pd

start_date = input("Enter the start date (YYYY-MM-DD): ")
end_date = input("Enter the end date (YYYY-MM-DD): ")

start_datetime = pd.to_datetime(start_date)
end_datetime = pd.to_datetime(end_date)

time_delta = end_datetime - start_datetime



days = time_delta.days
hours = time_delta.seconds // 3600
minutes = (time_delta.seconds % 3600) // 60

print(f"The difference between {start_date} and {end_date} is {days} days, {hours} hours, and {minutes} minutes.")

Enter the start date (YYYY-MM-DD):  2023-01-01
Enter the end date (YYYY-MM-DD):  2023-01-02

The difference between 2023-01-01 and 2023-01-02 is 1 days, 0 hours, and 0 minutes.

### Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified column to a categorical data type. The program should prompt the user to enter the file path, column name, and category order, and then display the sorted data.

In [ ]:
import pandas as pd

# Prompt the user to enter the file path
file_path = input("Enter the file path: ")

# Read the CSV file
data = pd.read_csv(file_path)

# Prompt the user to enter the column name
column_name = input("Enter the column name: ")

# Convert the specified column to a categorical data type
data[column_name] = pd.Categorical(data[column_name])

# Prompt the user to enter the category order
category_order = input("Enter the category order (comma-separated): ")

# Set the category order
data[column_name] = data[column_name].cat.set_categories(category_order.split(","))

# Display the sorted data
print(data.sort_values(by=[column_name]))

### Q10. Write a Python program that reads a CSV file containing sales data for different products and visualizes the data using a stacked bar chart to show the sales of each product category over time. The program should prompt the user to enter the file path and display the chart.

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

# Prompt the user to enter the file path
file_path = input("Enter the file path: ")

# Read the CSV file
data = pd.read_csv(file_path)

# Convert the date column to datetime format
data['date'] = pd.to_datetime(data['date'])

# Group the data by date and product category
grouped_data = data.groupby(['date', 'product_category'])['sales'].sum().unstack()

# Plot the stacked bar chart
grouped_data.plot(kind='bar', stacked=True)

# Set the chart title and axis labels
plt.title('Sales by Product Category')
plt.xlabel('Date')
plt.ylabel('Sales')

# Display the chart
plt.show()

### Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and displays the results in a table.

In [ ]:
import pandas as pd

# Prompt the user to enter the file path
file_path = input("Enter the file path: ")

# Read the CSV file
data = pd.read_csv(file_path)

# Calculate the mean, median, and mode of the test scores
mean = data['test_score'].mean()
median = data['test_score'].median()
mode = data['test_score'].mode()[0]

# Display the results in a table
print(f"{'Statistic':<10} {'Value':<10}")
print(f"{'Mean':<10} {mean:<10.2f}")
print(f"{'Median':<10} {median:<10.2f}")
print(f"{'Mode':<10} {mode:<10.2f}")

## END